---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DPartFailures.PartsCannotBeCreatedFromInvalidGeom
source: html/41f8f421-1e87-614d-8bcd-268eb505f624.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DPartFailures.PartsCannotBeCreatedFromInvalidGeom Property

Post failure when attempts to create parts from invalid geometry.

## Syntax (C#)
```csharp
public static FailureDefinitionId PartsCannotBeCreatedFromInvalidGeom { get; }
```